---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions
source: html/49b0be90-7d7f-ab4b-ce6a-c5aa81a8cc71.htm
---
# EnergyAnalysisDetailModelOptions Properties

It indicates whether the energy model is based on rooms/spaces or building elements.